Revit 2024 API
ModelPathUtils Class
 Utility functions using ModelPaths
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static class ModelPathUtils
Visual Basic
Public NotInheritable Class ModelPathUtils
Visual C++
public ref class ModelPathUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ModelPathUtils
See Also
ModelPathUtils Members
Autodesk.Revit.DB Namespace